Revit 2015 API
MeshArray.Item Property
Gets or sets a mesh at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual Mesh this[
	int index
] { get; set; }
Visual Basic
Public Overridable Property Item ( _
	index As Integer _
) As Mesh
	Get
	Set
Visual C++
public:
virtual property Mesh^ Item[int index] {
	Mesh^ get (int index);
	void set (int index, Mesh^ value);
}
Parameters
index
Type: System.Int32
The index of the mesh to be set or retrieved.
Return Value
Returns the mesh at the specified index.
See Also
MeshArray Class
Autodesk.Revit.DB Namespace